Infineon/mtb-xmclib-cat3/CMSIS/Infineon/COMPONENT_XMC4504/Include/XMC4504.h
/* --------------------------------  USB_DIEPTXF3  -------------------------------- */
#define USB_DIEPTXF3_INEPnTxFStAddr_Pos       (0UL)                     /*!< USB DIEPTXF3: INEPnTxFStAddr (Bit 0)                        */
#define USB_DIEPTXF3_INEPnTxFStAddr_Msk       (0xffffUL)                /*!< USB DIEPTXF3: INEPnTxFStAddr (Bitfield-Mask: 0xffff)        */
#define USB_DIEPTXF3_INEPnTxFDep_Pos          (16UL)                    /*!< USB DIEPTXF3: INEPnTxFDep (Bit 16)                          */
#define USB_DIEPTXF3_INEPnTxFDep_Msk          (0xffff0000UL)            /*!< USB DIEPTXF3: INEPnTxFDep (Bitfield-Mask: 0xffff)           */

/* --------------------------------  USB_DIEPTXF4  -------------------------------- */
#define USB_DIEPTXF4_INEPnTxFStAddr_Pos       (0UL)                     /*!< USB DIEPTXF4: INEPnTxFStAddr (Bit 0)                        */
#define USB_DIEPTXF4_INEPnTxFStAddr_Msk       (0xffffUL)                /*!< USB DIEPTXF4: INEPnTxFStAddr (Bitfield-Mask: 0xffff)        */
#define USB_DIEPTXF4_INEPnTxFDep_Pos          (16UL)                    /*!< USB DIEPTXF4: INEPnTxFDep (Bit 16)                          */
#define USB_DIEPTXF4_INEPnTxFDep_Msk          (0xffff0000UL)            /*!< USB DIEPTXF4: INEPnTxFDep (Bitfield-Mask: 0xffff)           */

/* --------------------------------  USB_DIEPTXF5  -------------------------------- */
#define USB_DIEPTXF5_INEPnTxFStAddr_Pos       (0UL)                     /*!< USB DIEPTXF5: INEPnTxFStAddr (Bit 0)                        */
#define USB_DIEPTXF5_INEPnTxFStAddr_Msk       (0xffffUL)                /*!< USB DIEPTXF5: INEPnTxFStAddr (Bitfield-Mask: 0xffff)        */
#define USB_DIEPTXF5_INEPnTxFDep_Pos          (16UL)                    /*!< USB DIEPTXF5: INEPnTxFDep (Bit 16)                          */
#define USB_DIEPTXF5_INEPnTxFDep_Msk          (0xffff0000UL)            /*!< USB DIEPTXF5: INEPnTxFDep (Bitfield-Mask: 0xffff)           */

/* --------------------------------  USB_DIEPTXF6  -------------------------------- */
#define USB_DIEPTXF6_INEPnTxFStAddr_Pos       (0UL)                     /*!< USB DIEPTXF6: INEPnTxFStAddr (Bit 0)                        */
#define USB_DIEPTXF6_INEPnTxFStAddr_Msk       (0xffffUL)                /*!< USB DIEPTXF6: INEPnTxFStAddr (Bitfield-Mask: 0xffff)        */
#define USB_DIEPTXF6_INEPnTxFDep_Pos          (16UL)                    /*!< USB DIEPTXF6: INEPnTxFDep (Bit 16)                          */
#define USB_DIEPTXF6_INEPnTxFDep_Msk          (0xffff0000UL)            /*!< USB DIEPTXF6: INEPnTxFDep (Bitfield-Mask: 0xffff)           */

/* ----------------------------------  USB_HCFG  ---------------------------------- */
#define USB_HCFG_FSLSPclkSel_Pos              (0UL)                     /*!< USB HCFG: FSLSPclkSel (Bit 0)                               */
#define USB_HCFG_FSLSPclkSel_Msk              (0x3UL)                   /*!< USB HCFG: FSLSPclkSel (Bitfield-Mask: 0x03)                 */
#define USB_HCFG_FSLSSupp_Pos                 (2UL)                     /*!< USB HCFG: FSLSSupp (Bit 2)                                  */
#define USB_HCFG_FSLSSupp_Msk                 (0x4UL)                   /*!< USB HCFG: FSLSSupp (Bitfield-Mask: 0x01)                    */
#define USB_HCFG_DescDMA_Pos                  (23UL)                    /*!< USB HCFG: DescDMA (Bit 23)                                  */
#define USB_HCFG_DescDMA_Msk                  (0x800000UL)              /*!< USB HCFG: DescDMA (Bitfield-Mask: 0x01)                     */
#define USB_HCFG_FrListEn_Pos                 (24UL)                    /*!< USB HCFG: FrListEn (Bit 24)                                 */
#define USB_HCFG_FrListEn_Msk                 (0x3000000UL)             /*!< USB HCFG: FrListEn (Bitfield-Mask: 0x03)                    */
#define USB_HCFG_PerSchedEna_Pos              (26UL)                    /*!< USB HCFG: PerSchedEna (Bit 26)                              */
#define USB_HCFG_PerSchedEna_Msk              (0x4000000UL)             /*!< USB HCFG: PerSchedEna (Bitfield-Mask: 0x01)                 */

/* ----------------------------------  USB_HFIR  ---------------------------------- */
#define USB_HFIR_FrInt_Pos                    (0UL)                     /*!< USB HFIR: FrInt (Bit 0)                                     */
#define USB_HFIR_FrInt_Msk                    (0xffffUL)                /*!< USB HFIR: FrInt (Bitfield-Mask: 0xffff)                     */
#define USB_HFIR_HFIRRldCtrl_Pos              (16UL)                    /*!< USB HFIR: HFIRRldCtrl (Bit 16)                              */
#define USB_HFIR_HFIRRldCtrl_Msk              (0x10000UL)               /*!< USB HFIR: HFIRRldCtrl (Bitfield-Mask: 0x01)                 */

/* ----------------------------------  USB_HFNUM  --------------------------------- */
#define USB_HFNUM_FrNum_Pos                   (0UL)                     /*!< USB HFNUM: FrNum (Bit 0)                                    */
#define USB_HFNUM_FrNum_Msk                   (0xffffUL)                /*!< USB HFNUM: FrNum (Bitfield-Mask: 0xffff)                    */
#define USB_HFNUM_FrRem_Pos                   (16UL)                    /*!< USB HFNUM: FrRem (Bit 16)                                   */
#define USB_HFNUM_FrRem_Msk                   (0xffff0000UL)            /*!< USB HFNUM: FrRem (Bitfield-Mask: 0xffff)                    */

/* ---------------------------------  USB_HPTXSTS  -------------------------------- */
#define USB_HPTXSTS_PTxFSpcAvail_Pos          (0UL)                     /*!< USB HPTXSTS: PTxFSpcAvail (Bit 0)                           */
#define USB_HPTXSTS_PTxFSpcAvail_Msk          (0xffffUL)                /*!< USB HPTXSTS: PTxFSpcAvail (Bitfield-Mask: 0xffff)           */
#define USB_HPTXSTS_PTxQSpcAvail_Pos          (16UL)                    /*!< USB HPTXSTS: PTxQSpcAvail (Bit 16)                          */
#define USB_HPTXSTS_PTxQSpcAvail_Msk          (0xff0000UL)              /*!< USB HPTXSTS: PTxQSpcAvail (Bitfield-Mask: 0xff)             */
#define USB_HPTXSTS_PTxQTop_Pos               (24UL)                    /*!< USB HPTXSTS: PTxQTop (Bit 24)                               */
#define USB_HPTXSTS_PTxQTop_Msk               (0xff000000UL)            /*!< USB HPTXSTS: PTxQTop (Bitfield-Mask: 0xff)                  */

/* ----------------------------------  USB_HAINT  --------------------------------- */
#define USB_HAINT_HAINT_Pos                   (0UL)                     /*!< USB HAINT: HAINT (Bit 0)                                    */
#define USB_HAINT_HAINT_Msk                   (0x3fffUL)                /*!< USB HAINT: HAINT (Bitfield-Mask: 0x3fff)                    */

/* --------------------------------  USB_HAINTMSK  -------------------------------- */
#define USB_HAINTMSK_HAINTMsk_Pos             (0UL)                     /*!< USB HAINTMSK: HAINTMsk (Bit 0)                              */
#define USB_HAINTMSK_HAINTMsk_Msk             (0x3fffUL)                /*!< USB HAINTMSK: HAINTMsk (Bitfield-Mask: 0x3fff)              */

/* --------------------------------  USB_HFLBADDR  -------------------------------- */
#define USB_HFLBADDR_Starting_Address_Pos     (0UL)                     /*!< USB HFLBADDR: Starting_Address (Bit 0)                      */
#define USB_HFLBADDR_Starting_Address_Msk     (0xffffffffUL)            /*!< USB HFLBADDR: Starting_Address (Bitfield-Mask: 0xffffffff)  */

