Infineon/mtb-xmclib-cat3/CMSIS/Infineon/COMPONENT_XMC4504/Include/XMC4504.h
/* --------------------------------  PORT15_IOCR0  -------------------------------- */
#define PORT15_IOCR0_PC0_Pos                  (3UL)                     /*!< PORT15 IOCR0: PC0 (Bit 3)                                   */
#define PORT15_IOCR0_PC0_Msk                  (0xf8UL)                  /*!< PORT15 IOCR0: PC0 (Bitfield-Mask: 0x1f)                     */
#define PORT15_IOCR0_PC1_Pos                  (11UL)                    /*!< PORT15 IOCR0: PC1 (Bit 11)                                  */
#define PORT15_IOCR0_PC1_Msk                  (0xf800UL)                /*!< PORT15 IOCR0: PC1 (Bitfield-Mask: 0x1f)                     */
#define PORT15_IOCR0_PC2_Pos                  (19UL)                    /*!< PORT15 IOCR0: PC2 (Bit 19)                                  */
#define PORT15_IOCR0_PC2_Msk                  (0xf80000UL)              /*!< PORT15 IOCR0: PC2 (Bitfield-Mask: 0x1f)                     */
#define PORT15_IOCR0_PC3_Pos                  (27UL)                    /*!< PORT15 IOCR0: PC3 (Bit 27)                                  */
#define PORT15_IOCR0_PC3_Msk                  (0xf8000000UL)            /*!< PORT15 IOCR0: PC3 (Bitfield-Mask: 0x1f)                     */

/* --------------------------------  PORT15_IOCR4  -------------------------------- */
#define PORT15_IOCR4_PC4_Pos                  (3UL)                     /*!< PORT15 IOCR4: PC4 (Bit 3)                                   */
#define PORT15_IOCR4_PC4_Msk                  (0xf8UL)                  /*!< PORT15 IOCR4: PC4 (Bitfield-Mask: 0x1f)                     */
#define PORT15_IOCR4_PC5_Pos                  (11UL)                    /*!< PORT15 IOCR4: PC5 (Bit 11)                                  */
#define PORT15_IOCR4_PC5_Msk                  (0xf800UL)                /*!< PORT15 IOCR4: PC5 (Bitfield-Mask: 0x1f)                     */
#define PORT15_IOCR4_PC6_Pos                  (19UL)                    /*!< PORT15 IOCR4: PC6 (Bit 19)                                  */
#define PORT15_IOCR4_PC6_Msk                  (0xf80000UL)              /*!< PORT15 IOCR4: PC6 (Bitfield-Mask: 0x1f)                     */
#define PORT15_IOCR4_PC7_Pos                  (27UL)                    /*!< PORT15 IOCR4: PC7 (Bit 27)                                  */
#define PORT15_IOCR4_PC7_Msk                  (0xf8000000UL)            /*!< PORT15 IOCR4: PC7 (Bitfield-Mask: 0x1f)                     */

/* --------------------------------  PORT15_IOCR8  -------------------------------- */
#define PORT15_IOCR8_PC8_Pos                  (3UL)                     /*!< PORT15 IOCR8: PC8 (Bit 3)                                   */
#define PORT15_IOCR8_PC8_Msk                  (0xf8UL)                  /*!< PORT15 IOCR8: PC8 (Bitfield-Mask: 0x1f)                     */
#define PORT15_IOCR8_PC9_Pos                  (11UL)                    /*!< PORT15 IOCR8: PC9 (Bit 11)                                  */
#define PORT15_IOCR8_PC9_Msk                  (0xf800UL)                /*!< PORT15 IOCR8: PC9 (Bitfield-Mask: 0x1f)                     */
#define PORT15_IOCR8_PC10_Pos                 (19UL)                    /*!< PORT15 IOCR8: PC10 (Bit 19)                                 */
#define PORT15_IOCR8_PC10_Msk                 (0xf80000UL)              /*!< PORT15 IOCR8: PC10 (Bitfield-Mask: 0x1f)                    */
#define PORT15_IOCR8_PC11_Pos                 (27UL)                    /*!< PORT15 IOCR8: PC11 (Bit 27)                                 */
#define PORT15_IOCR8_PC11_Msk                 (0xf8000000UL)            /*!< PORT15 IOCR8: PC11 (Bitfield-Mask: 0x1f)                    */

/* --------------------------------  PORT15_IOCR12  ------------------------------- */
#define PORT15_IOCR12_PC12_Pos                (3UL)                     /*!< PORT15 IOCR12: PC12 (Bit 3)                                 */
#define PORT15_IOCR12_PC12_Msk                (0xf8UL)                  /*!< PORT15 IOCR12: PC12 (Bitfield-Mask: 0x1f)                   */
#define PORT15_IOCR12_PC13_Pos                (11UL)                    /*!< PORT15 IOCR12: PC13 (Bit 11)                                */
#define PORT15_IOCR12_PC13_Msk                (0xf800UL)                /*!< PORT15 IOCR12: PC13 (Bitfield-Mask: 0x1f)                   */
#define PORT15_IOCR12_PC14_Pos                (19UL)                    /*!< PORT15 IOCR12: PC14 (Bit 19)                                */
#define PORT15_IOCR12_PC14_Msk                (0xf80000UL)              /*!< PORT15 IOCR12: PC14 (Bitfield-Mask: 0x1f)                   */
#define PORT15_IOCR12_PC15_Pos                (27UL)                    /*!< PORT15 IOCR12: PC15 (Bit 27)                                */
#define PORT15_IOCR12_PC15_Msk                (0xf8000000UL)            /*!< PORT15 IOCR12: PC15 (Bitfield-Mask: 0x1f)                   */

/* ----------------------------------  PORT15_IN  --------------------------------- */
#define PORT15_IN_P0_Pos                      (0UL)                     /*!< PORT15 IN: P0 (Bit 0)                                       */
#define PORT15_IN_P0_Msk                      (0x1UL)                   /*!< PORT15 IN: P0 (Bitfield-Mask: 0x01)                         */
#define PORT15_IN_P1_Pos                      (1UL)                     /*!< PORT15 IN: P1 (Bit 1)                                       */
#define PORT15_IN_P1_Msk                      (0x2UL)                   /*!< PORT15 IN: P1 (Bitfield-Mask: 0x01)                         */
#define PORT15_IN_P2_Pos                      (2UL)                     /*!< PORT15 IN: P2 (Bit 2)                                       */
#define PORT15_IN_P2_Msk                      (0x4UL)                   /*!< PORT15 IN: P2 (Bitfield-Mask: 0x01)                         */
#define PORT15_IN_P3_Pos                      (3UL)                     /*!< PORT15 IN: P3 (Bit 3)                                       */
#define PORT15_IN_P3_Msk                      (0x8UL)                   /*!< PORT15 IN: P3 (Bitfield-Mask: 0x01)                         */
#define PORT15_IN_P4_Pos                      (4UL)                     /*!< PORT15 IN: P4 (Bit 4)                                       */
#define PORT15_IN_P4_Msk                      (0x10UL)                  /*!< PORT15 IN: P4 (Bitfield-Mask: 0x01)                         */
#define PORT15_IN_P5_Pos                      (5UL)                     /*!< PORT15 IN: P5 (Bit 5)                                       */
#define PORT15_IN_P5_Msk                      (0x20UL)                  /*!< PORT15 IN: P5 (Bitfield-Mask: 0x01)                         */
#define PORT15_IN_P6_Pos                      (6UL)                     /*!< PORT15 IN: P6 (Bit 6)                                       */
#define PORT15_IN_P6_Msk                      (0x40UL)                  /*!< PORT15 IN: P6 (Bitfield-Mask: 0x01)                         */
#define PORT15_IN_P7_Pos                      (7UL)                     /*!< PORT15 IN: P7 (Bit 7)                                       */
#define PORT15_IN_P7_Msk                      (0x80UL)                  /*!< PORT15 IN: P7 (Bitfield-Mask: 0x01)                         */
#define PORT15_IN_P8_Pos                      (8UL)                     /*!< PORT15 IN: P8 (Bit 8)                                       */
#define PORT15_IN_P8_Msk                      (0x100UL)                 /*!< PORT15 IN: P8 (Bitfield-Mask: 0x01)                         */
#define PORT15_IN_P9_Pos                      (9UL)                     /*!< PORT15 IN: P9 (Bit 9)                                       */
#define PORT15_IN_P9_Msk                      (0x200UL)                 /*!< PORT15 IN: P9 (Bitfield-Mask: 0x01)                         */
#define PORT15_IN_P10_Pos                     (10UL)                    /*!< PORT15 IN: P10 (Bit 10)                                     */
#define PORT15_IN_P10_Msk                     (0x400UL)                 /*!< PORT15 IN: P10 (Bitfield-Mask: 0x01)                        */
#define PORT15_IN_P11_Pos                     (11UL)                    /*!< PORT15 IN: P11 (Bit 11)                                     */
#define PORT15_IN_P11_Msk                     (0x800UL)                 /*!< PORT15 IN: P11 (Bitfield-Mask: 0x01)                        */
#define PORT15_IN_P12_Pos                     (12UL)                    /*!< PORT15 IN: P12 (Bit 12)                                     */
#define PORT15_IN_P12_Msk                     (0x1000UL)                /*!< PORT15 IN: P12 (Bitfield-Mask: 0x01)                        */
#define PORT15_IN_P13_Pos                     (13UL)                    /*!< PORT15 IN: P13 (Bit 13)                                     */
#define PORT15_IN_P13_Msk                     (0x2000UL)                /*!< PORT15 IN: P13 (Bitfield-Mask: 0x01)                        */
#define PORT15_IN_P14_Pos                     (14UL)                    /*!< PORT15 IN: P14 (Bit 14)                                     */
#define PORT15_IN_P14_Msk                     (0x4000UL)                /*!< PORT15 IN: P14 (Bitfield-Mask: 0x01)                        */
#define PORT15_IN_P15_Pos                     (15UL)                    /*!< PORT15 IN: P15 (Bit 15)                                     */
#define PORT15_IN_P15_Msk                     (0x8000UL)                /*!< PORT15 IN: P15 (Bitfield-Mask: 0x01)                        */

/* --------------------------------  PORT15_PDISC  -------------------------------- */
#define PORT15_PDISC_PDIS2_Pos                (2UL)                     /*!< PORT15 PDISC: PDIS2 (Bit 2)                                 */
#define PORT15_PDISC_PDIS2_Msk                (0x4UL)                   /*!< PORT15 PDISC: PDIS2 (Bitfield-Mask: 0x01)                   */
#define PORT15_PDISC_PDIS3_Pos                (3UL)                     /*!< PORT15 PDISC: PDIS3 (Bit 3)                                 */
#define PORT15_PDISC_PDIS3_Msk                (0x8UL)                   /*!< PORT15 PDISC: PDIS3 (Bitfield-Mask: 0x01)                   */
#define PORT15_PDISC_PDIS4_Pos                (4UL)                     /*!< PORT15 PDISC: PDIS4 (Bit 4)                                 */
#define PORT15_PDISC_PDIS4_Msk                (0x10UL)                  /*!< PORT15 PDISC: PDIS4 (Bitfield-Mask: 0x01)                   */
#define PORT15_PDISC_PDIS5_Pos                (5UL)                     /*!< PORT15 PDISC: PDIS5 (Bit 5)                                 */
#define PORT15_PDISC_PDIS5_Msk                (0x20UL)                  /*!< PORT15 PDISC: PDIS5 (Bitfield-Mask: 0x01)                   */
#define PORT15_PDISC_PDIS6_Pos                (6UL)                     /*!< PORT15 PDISC: PDIS6 (Bit 6)                                 */
#define PORT15_PDISC_PDIS6_Msk                (0x40UL)                  /*!< PORT15 PDISC: PDIS6 (Bitfield-Mask: 0x01)                   */
#define PORT15_PDISC_PDIS7_Pos                (7UL)                     /*!< PORT15 PDISC: PDIS7 (Bit 7)                                 */
#define PORT15_PDISC_PDIS7_Msk                (0x80UL)                  /*!< PORT15 PDISC: PDIS7 (Bitfield-Mask: 0x01)                   */
#define PORT15_PDISC_PDIS8_Pos                (8UL)                     /*!< PORT15 PDISC: PDIS8 (Bit 8)                                 */
#define PORT15_PDISC_PDIS8_Msk                (0x100UL)                 /*!< PORT15 PDISC: PDIS8 (Bitfield-Mask: 0x01)                   */
#define PORT15_PDISC_PDIS9_Pos                (9UL)                     /*!< PORT15 PDISC: PDIS9 (Bit 9)                                 */
#define PORT15_PDISC_PDIS9_Msk                (0x200UL)                 /*!< PORT15 PDISC: PDIS9 (Bitfield-Mask: 0x01)                   */
#define PORT15_PDISC_PDIS12_Pos               (12UL)                    /*!< PORT15 PDISC: PDIS12 (Bit 12)                               */
#define PORT15_PDISC_PDIS12_Msk               (0x1000UL)                /*!< PORT15 PDISC: PDIS12 (Bitfield-Mask: 0x01)                  */
#define PORT15_PDISC_PDIS13_Pos               (13UL)                    /*!< PORT15 PDISC: PDIS13 (Bit 13)                               */
#define PORT15_PDISC_PDIS13_Msk               (0x2000UL)                /*!< PORT15 PDISC: PDIS13 (Bitfield-Mask: 0x01)                  */
#define PORT15_PDISC_PDIS14_Pos               (14UL)                    /*!< PORT15 PDISC: PDIS14 (Bit 14)                               */
#define PORT15_PDISC_PDIS14_Msk               (0x4000UL)                /*!< PORT15 PDISC: PDIS14 (Bitfield-Mask: 0x01)                  */
#define PORT15_PDISC_PDIS15_Pos               (15UL)                    /*!< PORT15 PDISC: PDIS15 (Bit 15)                               */
#define PORT15_PDISC_PDIS15_Msk               (0x8000UL)                /*!< PORT15 PDISC: PDIS15 (Bitfield-Mask: 0x01)                  */

